[
    {
        "id": 1,
        "name": "The Witcher 3: Wild Hunt",
        "description": "The Witcher 3: Wild Hunt is a 2015 action role-playing video game developed and published by CD Projekt. Based on The Witcher series of fantasy novels by Polish author Andrzej Sapkowski, it is the sequel to the 2011 game The Witcher 2: Assassins of Kings and the third main installment in The Witcher video game series, played in an open world with a third-person perspective.",
        "price": 39.99,
        "image": "images/Witcher3.jpeg",
        "genre": "RPG",
        "rating": 9.3,
        "platform": "PC",
        "releaseDate": "2015-05-18",
        "developer": "CD Projekt Red",
        "mode": "Single Player"
    },
    {
        "id": 2,
        "name": "The Witcher 2: Assassins of Kings",
        "description": "The Witcher 2: Assassins of Kings is a 2011 action role-playing video game developed by CD Projekt RED and published by Atari. It is the second game in The Witcher series, played in an open world with a third-person perspective. The game is set in a medieval fantasy world based on Polish author Andrzej Sapkowski's Witcher series of novels.",
        "price": 19.99,
        "image": "images/Witcher2.jpeg",
        "genre": "RPG",
        "rating": 8.5,
        "platform": "PC",
        "releaseDate": "2011-05-17",
        "developer": "CD Projekt Red",
        "mode": "Single Player"
    },
    {
        "id": 3,
        "name": "Assassin's Creed Brotherhood",
        "description": "Assassin's Creed: Brotherhood is a 2010 action-adventure video game developed by Ubisoft Montreal and published by Ubisoft. It is the fourth major installment in the Assassin's Creed series, and a direct sequel to 2009's Assassin's Creed II, with Ezio Auditore da Firenze returning as the protagonist.",
        "price": 9.99,
        "image": "images/ac-brotherhood.webp",
        "genre": "RPG",
        "rating": 8.0,
        "platform": "PC",
        "releaseDate": "2010-11-16",
        "developer": "Ubisoft",
        "mode": "Single Player"
    },
    {
        "id": 4,
        "name": "Red Dead Redemption 2",
        "description": "Red Dead Redemption 2 is a 2018 action-adventure game developed and published by Rockstar Games. It is the third entry in the Red Dead series and a prequel to 2010's Red Dead Redemption. The game is played from a third-person perspective and its world is navigated on foot or by horseback.",
        "price": 59.99,
        "image": "images/Red dead redemption2.jpeg",
        "genre": "RPG",
        "rating": 10.0,
        "platform": "PC",
        "releaseDate": "2018-10-26",
        "developer": "Rockstar",
        "mode": ["Single Player", " Multiplayer"]
    },
    {
        "id": 5,
        "name": "Call of Duty: Black Ops",
        "description": "Call of Duty: Black Ops is a 2010 first-person shooter video game, developed by Treyarch and published by Activision. It is the seventh game in the Call of Duty series and the first Call of Duty game for the Wii, Nintendo DS, PlayStation 3, and Xbox 360. It was released worldwide on November 9, 2010.",
        "price": 19.99,
        "image": "images/COD black ops.jpeg",
        "genre": "FPS",
        "rating": 8.5,
        "platform": "PC",
        "releaseDate": "2010-11-09",
        "developer": "Treyarch",
        "mode": ["Single Player", " Multiplayer"]
    },
    {
        "id": 6,
        "name": "Assassin's Creed Rogue",
        "description": "Assassin's Creed Rogue is a 2014 action-adventure video game developed by Ubisoft Sofia and published by Ubisoft. It is the seventh major installment in the Assassin's Creed series, and a direct sequel to 2013's Assassin's Creed IV: Black Flag. It was released for the PlayStation 3 and Xbox 360 on November 11, 2014, and for Microsoft Windows on March 10, 2015.",
        "price": 19.99,
        "image": "images/ac-rogue.png",
        "genre": "RPG",
        "rating": 6.8,
        "platform": "PC",
        "releaseDate": "2014-11-11",
        "developer": "Ubisoft",
        "mode": "Single Player"
    }, 
    {
        "id": 7,
        "name": "Assassin's Creed Unity",
        "description": "Assassin's Creed Unity is a 2014 action-adventure video game developed by Ubisoft Montreal and published by Ubisoft. It is the sixth major installment in the Assassin's Creed series, and a successor to 2013's Assassin's Creed IV: Black Flag. It was released for PlayStation 4, Xbox One, and Microsoft Windows in November 2014.",
        "price": 19.99,
        "image": "images/ac-unity.webp",
        "genre": "RPG",
        "rating": 7.8,
        "platform": "PC",
        "releaseDate": "2014-11-11",
        "developer": "Ubisoft",
        "mode": "Single Player"
    },
    {
        "id": 8,
        "name": "Call of Duty: Cold War",
        "description": "Call of Duty: Cold War is a 2020 first-person shooter video game developed by Treyarch and Raven Software and published by Activision. It is the sixteenth installment in the Call of Duty series and the sequel to the 2019 game Call of Duty: Modern Warfare. It was released worldwide on November 13, 2020, for Microsoft Windows, PlayStation 4, PlayStation 5, Xbox One, and Xbox Series X/S.",
        "price": 49.99,
        "image": "images/COD-cold war.webp",
        "genre": "FPS",
        "rating": 7.0,
        "platform": "PC",
        "releaseDate": "2020-11-13",
        "developer": "Treyarch",
        "mode": ["Single Player", " Multiplayer"]
    },
    {
        "id": 9,
        "name": "Call of Duty: Modern Warfare",
        "description": "Call of Duty: Modern Warfare is a 2019 first-person shooter video game developed by Infinity Ward and published by Activision. It is the sixteenth primary installment in the Call of Duty series. The game was released for Microsoft Windows, PlayStation 4, and Xbox One on October 25, 2019, and for Stadia on November 19, 2019.",
        "price": 49.99,
        "image": "images/COD modern.jpg",
        "genre": "FPS",
        "rating": 8.2,
        "platform": "PC",
        "releaseDate": "2019-10-25",
        "developer": "Infinity Ward",
        "mode": ["Single Player", " Multiplayer"]        
    },
    {
        "id": 10,
        "name": "Cyberpunk 2077",
        "description": "Cyberpunk 2077 is an action role-playing video game developed and published by CD Projekt. It is scheduled to be released for Microsoft Windows, PlayStation 4, PlayStation 5, Stadia, Xbox One, and Xbox Series X/S on December 10, 2020. The game is set in Night City, an open world with six distinct regions.",
        "price": 59.99,
        "image": "images/cyberpunk-2077.jpeg",
        "genre": "RPG",
        "rating": 9.0,
        "platform": "PC",
        "releaseDate": "2020-12-10",
        "developer": "CD Projekt Red",
        "mode": "Single Player"
    },
    {
        "id": 11,
        "name": "Assassin's Creed Valhalla",
        "description": "Assassin's Creed Valhalla is an action role-playing video game developed by Ubisoft Montreal and published by Ubisoft. It is the twelfth major installment and the twenty-second release in the Assassin's Creed series, and a successor to 2018's Assassin's Creed Odyssey. It was released for Microsoft Windows, PlayStation 4, Stadia, Xbox One, and Xbox Series X/S on November 10, 2020.",
        "price": 39.99,
        "image": "images/ac-valhalla.jpeg",
        "genre": "RPG",
        "rating": 8.0,
        "platform": "PC",
        "releaseDate": "2020-11-10",
        "developer": "Ubisoft",
        "mode": "Single Player"
    }, 
    {
        "id": 12,
        "name": "GTA V",
        "description": "Grand Theft Auto V is an action-adventure video game developed by Rockstar North and published by Rockstar Games. It was released on 17 September 2013 for the PlayStation 3 and Xbox 360, on 18 November 2014 for the PlayStation 4 and Xbox One, and on 14 April 2015 for Microsoft Windows.",
        "price": 29.99,
        "image": "images/GTA5.jpg",
        "genre": "RPG",
        "rating": 10.0,
        "platform": "PC",
        "releaseDate": "2013-09-17",
        "developer": "Rockstar",
        "mode": ["Single Player", " Multiplayer"]
    }
]